Тест_ЗУП_31_КОРП/src/Catalogs/Работодатели/Работодатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Работодатели</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТерриториальногоОрганаФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>135</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерФСС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКодФСС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПодчиненностиФСС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/Работодатели/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция РаботодательПоОрганизации(Организация) Экспорт
	
	Работодатель = Неопределено;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "ИНН,РегистрацияВНалоговомОргане");
		КПП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыОрганизации.РегистрацияВНалоговомОргане, "КПП");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Работодатели.Ссылка
		|ИЗ
		|	Справочник.Работодатели КАК Работодатели
		|ГДЕ
		|	Работодатели.ИНН = &ИНН
		|	И Работодатели.КПП = &КПП";
		Запрос.УстановитьПараметр("ИНН", РеквизитыОрганизации.ИНН);
		Запрос.УстановитьПараметр("КПП", КПП);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Работодатель = Выборка.Ссылка;
		КонецЕсли;
		
		Если Работодатель = Неопределено Тогда
			НовыйРаботодатель = СоздатьЭлемент();
			НовыйРаботодатель.Заполнить(Новый Структура("Организация", Организация));
			НовыйРаботодатель.Записать();
			Работодатель = НовыйРаботодатель.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Работодатель; 
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
